In [1]:
!del sample.db

zsh:1: command not found: del

In [2]:
import sqlite3

# create the connectin object 
conn = sqlite3.connect("sample.db")

# create cursor 
cursor = conn.cursor()

In [3]:
create_table = """ 
                CREATE TABLE EMPLOYEE(
                FIRST_NAME CHAR(20) NOT NULL,
                LAST_NAME CHAR(20),
                AGE INT NOT NULL,
                SEX CHAR(1),
                INCOME FLOAT)
                """

# execute the ddl 
cursor.execute(create_table)
conn.commit()


# fetch all the records 
cursor.fetchall()

OperationalError: table EMPLOYEE already exists

In [ ]:
# insert data into database in single shot
insertion_command = """
INSERT INTO EMPLOYEE (FIRST_NAME,LAST_NAME, AGE,SEX,INCOME)
VALUES 
('John','snow','M', NULL ,50000.0),
('RAJAN','GHIMIRE','M', 25 ,550000.0),
('NAJAR','GHIMIRE','M', 25 ,550000.0);
"""
# execute the ddl 
cursor.execute(insertion_command)
conn.commit()

In [ ]:
# get the entries from the first column
cursor.execute("SELECT * from EMPLOYEE")

In [ ]:
for x in cursor:
    print(x)

**Execute Many**

In [ ]:
data = [
  ("Prajwal","Luitel",23,"M",15000000),
  ("Sambridhi","Luitel",23,"F",15000000)
]

stmt = "INSERT INTO EMPLOYEE (FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES (?, ?, ?, ?, ?)"
cursor.executemany(stmt, data)
conn.commit()

In [ ]:
# get the entries from the first column
cursor.execute("SELECT * from EMPLOYEE")
# for x in cursor:
#     print(x)

In [ ]:
cursor.fetchone()

In [ ]:
cursor.fetchall()

**Update**

In [ ]:
sql = """UPDATE EMPLOYEE SET AGE=AGE+1 WHERE SEX='M'"""
cursor.execute(sql)
conn.commit()


cursor.execute("SELECT * from EMPLOYEE")
for x in cursor:
    print(x)

**Extra Questions:**

In [ ]:
# rename column sex to gender. 
cursor.execute('''ALTER TABLE EMPLOYEE RENAME COLUMN SEX TO GENDER''')
conn.commit()

# rename the whole table 
cursor.execute("""ALTER TABLE EMPLOYEE RENAME TO Employee_UPDATED""")
conn.commit()

**DELETE DATA**

In [ ]:
# delete record where Sambridhi
delete_query = """DELETE FROM Employee_UPDATED WHERE FIRST_NAME = 'Sambridhi'"""
# execute the cooman
cursor.execute(delete_query)

conn.commit()

# select from the table
cursor.execute("SELECT * from Employee_UPDATED")

cursor.fetchall()